Revit 2027 API
WallSweepInfo.IsCutByInserts Property
 Indicates if the sweep is cut by wall inserts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCutByInserts { get; set; }
Public Property IsCutByInserts As Boolean
	Get
	Set
public:
property bool IsCutByInserts {
	bool get ();
	void set (bool value);
}
member IsCutByInserts : bool with get, set
Property Value
Boolean
 True if the sweep is cut by wall inserts, false otherwise.
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace